// https://www.acmicpc.net/problem/2870

#include<bits/stdc++.h>

using namespace std;

/*
문제

숫자와 알파벳 소문자로 되어있는 글자가 N줄
상근이는 여기서 숫자를 모두 찾은 뒤, 이 숫자를 '비내림차순'으로 정리해야한다. 
숫자의 앞에 0이 있는 경우에는 정리하면서 생략할 수 있다.

글자를 살펴보다가 숫자가 나오는 경우에는, 가능한 가장 큰 숫자를 찾아야 한다. 
즉, 모든 숫자의 앞과 뒤에 문자가 있거나, 줄의 시작 또는 끝이어야 한다.

예를 들어, 01a2b3456cde478에서 숫자를 찾으면 1, 2, 3456, 478이다.

선생님이 준 종이의 내용이 주어졌을 때, 상근이의 숙제를 대신하는 프로그램을 작성하시오.



출력
종이에서 찾은 숫자의 개수를 M이라고 하면, 출력은 M줄로 이루어져야 한다. 
각 줄에는 종이에서 찾은 숫자를 하나씩 출력해야 한다. 
이때, 비내림차순으로 출력해야 한다. 
비내림차순은 내림차순의 반대인 경우인데, 다음 수가 앞의 수보다 크거나 같은 경우를 말한다.

*/

/*
입력
첫째 줄에 종이의 줄의 개수 N이 주어진다. (1 ≤ N ≤ 100)
다음 N개의 줄에는 각 줄의 내용이 주어진다. 각 줄은 최대 100글자이고,
항상 알파벳 소문자와 숫자로만 이루어져 있다.
*/
int N;
string str;
vector<int> ans;
int main() {
    ios::sync_with_stdio(0); cin.tie(0);

    cin >> N;
    while(N--) {
        cin >> str;

        string s;
        for (int i = 0; i < str.size(); i++) {
            char& ch = str[i];
            // 숫자일 경우
            if ('0' <= ch && ch <= '9') s += ch;
            // 문자일 경우 

            else if (s.size()) {
                
            }
        }
    }

    return 0;
}

/*
예제 입력 1 
2
lo3za4
01

예제 출력 1 
1
3
4

예제 입력 2 
4
43silos0
zita002
le2sim
231233

예제 출력 2 
0
2
2
43
231233

예제 입력 3 
4
01bond
02james007
03bond
04austinpowers000

예제 출력 3 
0
1
2
3
4
7
*/